src/main/test/supply-chain/3-Calculation/0-Apply Tax/8-Tax Amounts/4-TC02.02.03_36_Local_currency_same_invoice_currency/0-TC02.02.03_36_Local_currency_same_invoice_currency__NetAmount/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <!--Optional:-->
         <arg0><DocumentId>
    <SystemSourceId>COMPASS001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CustomField1</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <GrossPriceCalculation>N</GrossPriceCalculation>
  <CalculationDecimalPlaces>0</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
	<GrossPriceCountry></GrossPriceCountry>
    <SellerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </SellerTaxTotal>
    <BuyerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </BuyerTaxTotal>
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
      <SellerLocalTaxCurrencyExchangeRate/>
      <SellerLocalTaxCurrencyCode/>
      <BuyerLocalTaxCurrencyExchangeRate/>
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>56000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.0</NetAmount>
      <ItemNetAmount></ItemNetAmount>
			  <GrossAmount></GrossAmount>
			  <ItemGrossAmount></ItemGrossAmount>
			  <Quantity></Quantity>
		      <SellerTax>
		        <SellerTaxCountry>
		          <TaxCalculationLineComponent>
		            <TaxAmount/>
					<ItemTaxAmount></ItemTaxAmount>
		            <GrossAmount/>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
		            <TaxAmountInLocalCurrency/>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxCountry>
		        <SellerTaxState>
		          <TaxCalculationLineComponent>
		            <TaxAmount></TaxAmount>
					<ItemTaxAmount></ItemTaxAmount>
					<GrossAmount></GrossAmount>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
					<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxState>
		      </SellerTax>
			  <BuyerTax>
				<BuyerTaxCountry>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxCountry>
				<BuyerTaxState>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxState>
			</BuyerTax> 
      <VariableTaxSteeringInput>
        <ConsignorCountry/>
        <ConsignorState/>
        <ConsignorBusinessUnitCode/>
        <ConsignorBusinessUnitType/>
        <ConsigneeCountry/>
        <ConsigneeState/>
        <ConsigneeBusinessUnitCode/>
        <ConsigneeBusinessUnitType/>
        <CarrierCountry/>
        <CarrierState/>
        <CarrierBusinessUnitCode/>
        <CarrierBusinessUnitType/>
        <ShipmentStartCountry/>
        <ShipmentEndCountry/>
        <ShipmentStartState/>
        <ShipmentEndState/>
        <ServiceRenderedCountry/>
        <ServiceRenderedState/>
        <ResalePurpose/>
        <IsOutBonded/>
        <IsInBonded/>
        <TaxPreAlgorithmOutput>
          <IsExport/>
          <IsImport/>
          <IsExported/>
          <IsImported/>
        </TaxPreAlgorithmOutput>
        <ShippingOfCustomsClearedGoods/>
      </VariableTaxSteeringInput>
      <BuyerTax/>
        
    </TaxInvoiceLine>
    <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>2</ItemNo>
      <ItemType/>
      <UNSPSC>10203000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.0</NetAmount>
      <ItemNetAmount></ItemNetAmount>
			  <GrossAmount></GrossAmount>
			  <ItemGrossAmount></ItemGrossAmount>
			  <Quantity></Quantity>
		      <SellerTax>
		        <SellerTaxCountry>
		          <TaxCalculationLineComponent>
		            <TaxAmount/>
					<ItemTaxAmount></ItemTaxAmount>
		            <GrossAmount/>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
		            <TaxAmountInLocalCurrency/>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxCountry>
		        <SellerTaxState>
		          <TaxCalculationLineComponent>
		            <TaxAmount></TaxAmount>
					<ItemTaxAmount></ItemTaxAmount>
					<GrossAmount></GrossAmount>
					<ItemGrossAmount></ItemGrossAmount>
					<NetAmount></NetAmount>
					<ItemNetAmount></ItemNetAmount>
					<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
					<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
		            <TaxCode/>
		            <TaxType>
		              <TaxTypeName/>
		              <TaxTypeAbbreviation/>
		              <TaxTypeDescription/>
		            </TaxType>
		            <TaxRate/>
		          </TaxCalculationLineComponent>
		        </SellerTaxState>
		      </SellerTax>
			  <BuyerTax>
				<BuyerTaxCountry>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxCountry>
				<BuyerTaxState>
					<TaxCalculationLineComponent>
						<TaxAmount></TaxAmount>
						<ItemTaxAmount></ItemTaxAmount>
						<GrossAmount></GrossAmount>
						<ItemGrossAmount></ItemGrossAmount>
						<NetAmount></NetAmount>
						<ItemNetAmount></ItemNetAmount>
						<TaxAmountInLocalCurrency></TaxAmountInLocalCurrency>
						<ItemTaxAmontInLocalCurrency></ItemTaxAmontInLocalCurrency>
						<TaxCode></TaxCode>
						<TaxType>
							<TaxTypeName></TaxTypeName>
							<TaxTypeAbbreviation></TaxTypeAbbreviation>
							<TaxTypeDescription></TaxTypeDescription>
						</TaxType>
						<TaxRate></TaxRate>
					</TaxCalculationLineComponent>
				</BuyerTaxState>
			</BuyerTax>
        
      <VariableTaxSteeringInput>
        <ConsignorCountry/>
        <ConsignorState/>
        <ConsignorBusinessUnitCode/>
        <ConsignorBusinessUnitType/>
        <ConsigneeCountry/>
        <ConsigneeState/>
        <ConsigneeBusinessUnitCode/>
        <ConsigneeBusinessUnitType/>
        <CarrierCountry/>
        <CarrierState/>
        <CarrierBusinessUnitCode/>
        <CarrierBusinessUnitType/>
        <ShipmentStartCountry/>
        <ShipmentEndCountry/>
        <ShipmentStartState/>
        <ShipmentEndState/>
        <ServiceRenderedCountry/>
        <ServiceRenderedState/>
        <ResalePurpose/>
        <IsOutBonded/>
        <IsInBonded/>
        <TaxPreAlgorithmOutput>
          <IsExport/>
          <IsImport/>
          <IsExported/>
          <IsImported/>
        </TaxPreAlgorithmOutput>
        <ShippingOfCustomsClearedGoods/>
      </VariableTaxSteeringInput>
        
    </TaxInvoiceLine>
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2013-12-06</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>N</SkipDecision>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>9000</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>7522</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose>Y</ResalePurpose>
    <IsOutBonded>N</IsOutBonded>
    <IsInBonded>N</IsInBonded>
    <TaxPreAlgorithmOutput>
      <IsExport>Y</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>7522</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
     
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    <CustomerID></CustomerID>
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>9000</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </SellerParty>
  <TermOfDelivery>DDU</TermOfDelivery></arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>